


# Вводится 2 числа с клавиатуры (от 1 до 20). Так же генерируется 2 числа рандомно.
# Посчитать, сколько раз пара введенных чисел с клавиатуры окажется больше
# рандомной пары. Проверку выполнить 7 раз.
# В случае равенства (количества, когда пара больше и всех остальных случаем)
# вывести случайные числа, полученные в 4 итерации.

from random import randint

first_num = int(input('Enter numder A from 1 to 20: '))
second_num = int(input('Enter numder B from 1 to 20: '))
num_sum = sum([first_num, second_num]) #сумма введенных с клавиатуры чисел
num_list = [] #переменная для хранения рандомных чисел из 4 иетрации
i = 0
counter = 0

while(i < 7):
    first_random = randint(1, 20) #генерация рандомного числа
    second_random = randint(1, 20) #генерация рандомного числа
    random_sum = sum([first_random, second_random]) #их сумма
    if num_sum > random_sum: #если сумма введенных больше суммы рандомных
        print('more') #принт для наглядности что бы каждая итерация была видна в консоли
        counter += 1 #увеличиваем счетчик если сумма введенных больше
    else:
        print('less') #принт для наглядности что бы каждая итерация была видна в консоли
    if i == 3: #четвертая итерация на ней надо записать рандомные числа в список
        num_list.append(first_random)
        num_list.append(second_random)
    i += 1 #увеличиваем счечик итераций что бы цикл остановился на условии i < 7

if counter > 3: #в условии сказано 7 проверок, значит 4 проверки это уже больше половины
    print(f'Fourth iteration random numbers: {num_list}')